README.org
* Description

  YAA is an artificial chemistry, centered around petri nets.
  
  The project also includes a webserver that can interact 
  with the simulation, and a web interface


* Setting up

  You will need a working OCaml developping environment, 
  ideally set-up with opam.

** OCaml libs dependancies
    + oasis
    + batteries
    + ppx\under{}deriving\under{}yojson
    + ocamlgraph

      (install with opam)

** Install
   
#+BEGIN_SRC
   oasis-setup
   make
#+END_SRC

* Run

#+BEGIN_SRC
web\under{}bact\under{}server [-port port]
#+END_SRC

Then visit =localhost:port=

* Usefull stuff
   ocaml tools (Installed with opam) :
    + merlin (completion and errors detection in emacs)
    + utop (advanced top-level)

   emacs tools (installed with melpa) : 
    + outshine / outorg
    + tuareg-mode
    + graphviz-dot mode

      
